module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
module.ecs_service.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=hello-birthday-api-service-exec-20250428113611622800000001]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-0af830a513094a3ff]
module.ecs_service.aws_cloudwatch_log_group.ecs_logs: Refreshing state... [id=/ecs/hello-birthday-api-service]
module.ecs_service.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=hello-birthday-api-service-exec]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-09af045e2b19f5f55]
module.vpc.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-014256314517644eb]
module.vpc.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-01a005edb364cadfa]
module.vpc.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-0146172e862a060a4]
module.vpc.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0f42f01dec32a48dd]
module.vpc.aws_kms_key.vpc_flow_logs: Refreshing state... [id=347137e7-8489-4dd5-8ff0-561bac764438]
module.ecs_cluster.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:cluster/cerepx-dev-cluster]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-029a6cd1da94ed29e]
module.rds.aws_kms_key.rds_performance_insights: Refreshing state... [id=c7a90af2-b80a-47f5-817d-76ef08929a64]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Reading...
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Reading...
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Read complete after 0s [id=1077804475]
module.vpc.aws_iam_role.flow_logs_role: Refreshing state... [id=vpc-flow-logs-role]
module.ecs_service.aws_iam_role.task_role: Refreshing state... [id=hello-birthday-api-service-task]
module.ecs_service.aws_ecs_task_definition.this: Refreshing state... [id=hello-birthday-api-service]
module.vpc.aws_iam_role_policy.flow_logs_policy: Refreshing state... [id=vpc-flow-logs-role:vpc-flow-logs-policy]
module.vpc.aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flowlogs/hello-birthday-dev]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-01c87601e22172550]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-07832cfb87db1c4c3]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b4f96a4a08eb4a5b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ddb2b3fdf159574c]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b360bbebcaa480e5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0116a9ef8764923a8]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0622864b918d283ed]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ca998b2f809f036c]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/ff3bf51d7d8836f7]
module.vpc.aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f0309c1f8f7d983e]
module.vpc.aws_security_group.ecs: Refreshing state... [id=sg-0ae81af3f721e51a4]
module.vpc.aws_route.default_internet_access: Refreshing state... [id=r-rtb-0b360bbebcaa480e51080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-000b959cb9c8c17b6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bc26398f249d5dad]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08047ccfb754ab73d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f88590ccfac5c504]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=hello-birthday-dev-subnet-group]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1]
module.ecs_service.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/cc875576fdfa60e1/e814949fb203c902]
module.rds.aws_db_instance.this: Refreshing state... [id=db-MNYKAUQQ3O3OCCMOP5A35SVKSM]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb.this will be updated in-place
  ~ resource "aws_lb" "this" {
        id                                                           = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1"
        name                                                         = "hello-birthday-api-alb"
      ~ security_groups                                              = [
          - "sg-0af830a513094a3ff",
        ]
        tags                                                         = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_cloudwatch_log_group.ecs_logs will be destroyed
  # (because aws_cloudwatch_log_group.ecs_logs is not in configuration)
  - resource "aws_cloudwatch_log_group" "ecs_logs" {
      - arn               = "arn:aws:logs:eu-west-1:456212641044:log-group:/ecs/hello-birthday-api-service" -> null
      - id                = "/ecs/hello-birthday-api-service" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/hello-birthday-api-service" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service"
        name                               = "hello-birthday-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:7" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ network_configuration {
          ~ assign_public_ip = false -> true
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = [
                      - {
                          - name  = "GUNICORN_WORKERS"
                          - value = "2"
                        },
                      - {
                          - name  = "MYSQL_HOST"
                          - value = "hello-birthday-dev-db.claz3uxrx5pl.eu-west-1.rds.amazonaws.com:3306"
                        },
                      - {
                          - name  = "MYSQL_PASSWORD"
                          - value = "devpassword123"
                        },
                      - {
                          - name  = "MYSQL_USER"
                          - value = "devadmin"
                        },
                    ]
                  - essential        = true
                  ~ image            = "456212641044.dkr.ecr.eu-west-1.amazonaws.com/hello-birthday-api:1.0.26" -> "456212641044.dkr.ecr.eu-west-1.amazonaws.com/hello-birthday-api:1.0.28"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/hello-birthday-api-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                    name             = "hello-birthday-api"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (1 unchanged attribute hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ execution_role_arn       = "arn:aws:iam::456212641044:role/hello-birthday-api-service-exec" -> (known after apply) # forces replacement
      ~ id                       = "hello-birthday-api-service" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.ecs_service.aws_iam_role.ecs_task_execution_role will be destroyed
  # (because aws_iam_role.ecs_task_execution_role is not in configuration)
  - resource "aws_iam_role" "ecs_task_execution_role" {
      - arn                   = "arn:aws:iam::456212641044:role/hello-birthday-api-service-exec" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-04-28T11:36:10Z" -> null
      - force_detach_policies = false -> null
      - id                    = "hello-birthday-api-service-exec" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "hello-birthday-api-service-exec" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "Name"        = "hello-birthday-api-service-exec"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "Name"        = "hello-birthday-api-service-exec"
        } -> null
      - unique_id             = "AROAWUODEOUKDMSRHCKV6" -> null
        # (3 unchanged attributes hidden)
    }

  # module.ecs_service.aws_iam_role.execution_role will be created
  + resource "aws_iam_role" "execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hello-birthday-api-service-exec"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_service.aws_iam_role.task_role will be updated in-place
  ~ resource "aws_iam_role" "task_role" {
        id                    = "hello-birthday-api-service-task"
        name                  = "hello-birthday-api-service-task"
      ~ tags                  = {
          - "Environment" = "dev" -> null
          - "Name"        = "hello-birthday-api-service-task" -> null
        }
      ~ tags_all              = {
          - "Environment" = "dev" -> null
          - "Name"        = "hello-birthday-api-service-task" -> null
        }
        # (11 unchanged attributes hidden)
    }

  # module.ecs_service.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_role_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      - id         = "hello-birthday-api-service-exec-20250428113611622800000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "hello-birthday-api-service-exec" -> null
    }

  # module.vpc.aws_security_group.alb will be destroyed
  # (because aws_security_group.alb is not in configuration)
  - resource "aws_security_group" "alb" {
      - arn                    = "arn:aws:ec2:eu-west-1:456212641044:security-group/sg-0af830a513094a3ff" -> null
      - description            = "Security group for the Application Load Balancer" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0af830a513094a3ff" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow HTTP from anywhere"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow HTTPS from anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "hello-birthday-dev-alb-sg" -> null
      - owner_id               = "456212641044" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "hello-birthday-dev-alb-sg"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "hello-birthday-dev-alb-sg"
        } -> null
      - vpc_id                 = "vpc-029a6cd1da94ed29e" -> null
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_security_group.ecs will be updated in-place
  ~ resource "aws_security_group" "ecs" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
        id                     = "sg-0ae81af3f721e51a4"
        name                   = "hello-birthday-dev-ecs-sg"
        tags                   = {
            "Environment" = "dev"
            "Name"        = "hello-birthday-dev-ecs-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.vpc_endpoints will be destroyed
  # (because aws_security_group.vpc_endpoints is not in configuration)
  - resource "aws_security_group" "vpc_endpoints" {
      - arn                    = "arn:aws:ec2:eu-west-1:456212641044:security-group/sg-014256314517644eb" -> null
      - description            = "Security group for VPC Interface Endpoints" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-014256314517644eb" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.10.0.0/16",
                ]
              - description      = "Allow HTTPS (443) from VPC"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "hello-birthday-dev-vpc-endpoints-sg" -> null
      - owner_id               = "456212641044" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "hello-birthday-dev-vpc-endpoints-sg"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "hello-birthday-dev-vpc-endpoints-sg"
        } -> null
      - vpc_id                 = "vpc-029a6cd1da94ed29e" -> null
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_vpc_endpoint.cloudwatch_logs will be destroyed
  # (because aws_vpc_endpoint.cloudwatch_logs is not in configuration)
  - resource "aws_vpc_endpoint" "cloudwatch_logs" {
      - arn                        = "arn:aws:ec2:eu-west-1:456212641044:vpc-endpoint/vpce-01a005edb364cadfa" -> null
      - cidr_blocks                = [] -> null
      - dns_entry                  = [
          - {
              - dns_name       = "vpce-01a005edb364cadfa-crxsy6d6.logs.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "vpce-01a005edb364cadfa-crxsy6d6-eu-west-1b.logs.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "vpce-01a005edb364cadfa-crxsy6d6-eu-west-1a.logs.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "logs.eu-west-1.amazonaws.com"
              - hosted_zone_id = "Z07441911AP2BHJVH8RSZ"
            },
          - {
              - dns_name       = "logs.eu-west-1.api.aws"
              - hosted_zone_id = "Z10289552F2O59MTT5L4Z"
            },
        ] -> null
      - id                         = "vpce-01a005edb364cadfa" -> null
      - ip_address_type            = "ipv4" -> null
      - network_interface_ids      = [
          - "eni-06918fb815b24805c",
          - "eni-0a979e6da1dc2b4d6",
        ] -> null
      - owner_id                   = "456212641044" -> null
      - policy                     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled        = true -> null
      - requester_managed          = false -> null
      - route_table_ids            = [] -> null
      - security_group_ids         = [
          - "sg-014256314517644eb",
        ] -> null
      - service_name               = "com.amazonaws.eu-west-1.logs" -> null
      - service_region             = "eu-west-1" -> null
      - state                      = "available" -> null
      - subnet_ids                 = [
          - "subnet-0ca998b2f809f036c",
          - "subnet-0ddb2b3fdf159574c",
        ] -> null
      - tags                       = {
          - "Name" = "hello-birthday-dev-cw-endpoint"
        } -> null
      - tags_all                   = {
          - "Name" = "hello-birthday-dev-cw-endpoint"
        } -> null
      - vpc_endpoint_type          = "Interface" -> null
      - vpc_id                     = "vpc-029a6cd1da94ed29e" -> null
        # (2 unchanged attributes hidden)

      - dns_options {
          - dns_record_ip_type                             = "ipv4" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }

      - subnet_configuration {
          - ipv4      = "10.10.101.114" -> null
          - subnet_id = "subnet-0ddb2b3fdf159574c" -> null
            # (1 unchanged attribute hidden)
        }
      - subnet_configuration {
          - ipv4      = "10.10.102.36" -> null
          - subnet_id = "subnet-0ca998b2f809f036c" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_vpc_endpoint.ecr_api will be destroyed
  # (because aws_vpc_endpoint.ecr_api is not in configuration)
  - resource "aws_vpc_endpoint" "ecr_api" {
      - arn                        = "arn:aws:ec2:eu-west-1:456212641044:vpc-endpoint/vpce-0146172e862a060a4" -> null
      - cidr_blocks                = [] -> null
      - dns_entry                  = [
          - {
              - dns_name       = "vpce-0146172e862a060a4-gwlyrztb.api.ecr.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "vpce-0146172e862a060a4-gwlyrztb-eu-west-1a.api.ecr.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "vpce-0146172e862a060a4-gwlyrztb-eu-west-1b.api.ecr.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "api.ecr.eu-west-1.amazonaws.com"
              - hosted_zone_id = "Z0910350J4BP1G7TUKII"
            },
          - {
              - dns_name       = "ecr.eu-west-1.api.aws"
              - hosted_zone_id = "Z09744733M4FH88AOEEM3"
            },
        ] -> null
      - id                         = "vpce-0146172e862a060a4" -> null
      - ip_address_type            = "ipv4" -> null
      - network_interface_ids      = [
          - "eni-0a104c25d47a340cf",
          - "eni-0ead51e41f4f8eed4",
        ] -> null
      - owner_id                   = "456212641044" -> null
      - policy                     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled        = true -> null
      - requester_managed          = false -> null
      - route_table_ids            = [] -> null
      - security_group_ids         = [
          - "sg-014256314517644eb",
        ] -> null
      - service_name               = "com.amazonaws.eu-west-1.ecr.api" -> null
      - service_region             = "eu-west-1" -> null
      - state                      = "available" -> null
      - subnet_ids                 = [
          - "subnet-0ca998b2f809f036c",
          - "subnet-0ddb2b3fdf159574c",
        ] -> null
      - tags                       = {
          - "Name" = "hello-birthday-dev-ecr-api-endpoint"
        } -> null
      - tags_all                   = {
          - "Name" = "hello-birthday-dev-ecr-api-endpoint"
        } -> null
      - vpc_endpoint_type          = "Interface" -> null
      - vpc_id                     = "vpc-029a6cd1da94ed29e" -> null
        # (2 unchanged attributes hidden)

      - dns_options {
          - dns_record_ip_type                             = "ipv4" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }

      - subnet_configuration {
          - ipv4      = "10.10.101.54" -> null
          - subnet_id = "subnet-0ddb2b3fdf159574c" -> null
            # (1 unchanged attribute hidden)
        }
      - subnet_configuration {
          - ipv4      = "10.10.102.220" -> null
          - subnet_id = "subnet-0ca998b2f809f036c" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_vpc_endpoint.ecr_dkr will be destroyed
  # (because aws_vpc_endpoint.ecr_dkr is not in configuration)
  - resource "aws_vpc_endpoint" "ecr_dkr" {
      - arn                        = "arn:aws:ec2:eu-west-1:456212641044:vpc-endpoint/vpce-0f42f01dec32a48dd" -> null
      - cidr_blocks                = [] -> null
      - dns_entry                  = [
          - {
              - dns_name       = "vpce-0f42f01dec32a48dd-10f8e60x.dkr.ecr.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "vpce-0f42f01dec32a48dd-10f8e60x-eu-west-1a.dkr.ecr.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "vpce-0f42f01dec32a48dd-10f8e60x-eu-west-1b.dkr.ecr.eu-west-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z38GZ743OKFT7T"
            },
          - {
              - dns_name       = "dkr.ecr.eu-west-1.amazonaws.com"
              - hosted_zone_id = "Z091014920QK8UE0BDM3S"
            },
          - {
              - dns_name       = "*.dkr.ecr.eu-west-1.amazonaws.com"
              - hosted_zone_id = "Z091014920QK8UE0BDM3S"
            },
          - {
              - dns_name       = "dkr-ecr.eu-west-1.on.aws"
              - hosted_zone_id = "Z099564618DCWQUHWRWIV"
            },
          - {
              - dns_name       = "*.dkr-ecr.eu-west-1.on.aws"
              - hosted_zone_id = "Z099564618DCWQUHWRWIV"
            },
        ] -> null
      - id                         = "vpce-0f42f01dec32a48dd" -> null
      - ip_address_type            = "ipv4" -> null
      - network_interface_ids      = [
          - "eni-00c53efb3ee745457",
          - "eni-076f4217d525092f4",
        ] -> null
      - owner_id                   = "456212641044" -> null
      - policy                     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled        = true -> null
      - requester_managed          = false -> null
      - route_table_ids            = [] -> null
      - security_group_ids         = [
          - "sg-014256314517644eb",
        ] -> null
      - service_name               = "com.amazonaws.eu-west-1.ecr.dkr" -> null
      - service_region             = "eu-west-1" -> null
      - state                      = "available" -> null
      - subnet_ids                 = [
          - "subnet-0ca998b2f809f036c",
          - "subnet-0ddb2b3fdf159574c",
        ] -> null
      - tags                       = {
          - "Name" = "hello-birthday-dev-ecr-dkr-endpoint"
        } -> null
      - tags_all                   = {
          - "Name" = "hello-birthday-dev-ecr-dkr-endpoint"
        } -> null
      - vpc_endpoint_type          = "Interface" -> null
      - vpc_id                     = "vpc-029a6cd1da94ed29e" -> null
        # (2 unchanged attributes hidden)

      - dns_options {
          - dns_record_ip_type                             = "ipv4" -> null
          - private_dns_only_for_inbound_resolver_endpoint = false -> null
        }

      - subnet_configuration {
          - ipv4      = "10.10.101.4" -> null
          - subnet_id = "subnet-0ddb2b3fdf159574c" -> null
            # (1 unchanged attribute hidden)
        }
      - subnet_configuration {
          - ipv4      = "10.10.102.103" -> null
          - subnet_id = "subnet-0ca998b2f809f036c" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_vpc_endpoint.s3 will be destroyed
  # (because aws_vpc_endpoint.s3 is not in configuration)
  - resource "aws_vpc_endpoint" "s3" {
      - arn                        = "arn:aws:ec2:eu-west-1:456212641044:vpc-endpoint/vpce-09af045e2b19f5f55" -> null
      - cidr_blocks                = [
          - "3.5.64.0/21",
          - "3.5.72.0/23",
          - "52.92.0.0/17",
          - "52.218.0.0/17",
        ] -> null
      - dns_entry                  = [] -> null
      - id                         = "vpce-09af045e2b19f5f55" -> null
      - network_interface_ids      = [] -> null
      - owner_id                   = "456212641044" -> null
      - policy                     = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id             = "pl-6da54004" -> null
      - private_dns_enabled        = false -> null
      - requester_managed          = false -> null
      - route_table_ids            = [
          - "rtb-01c87601e22172550",
        ] -> null
      - security_group_ids         = [] -> null
      - service_name               = "com.amazonaws.eu-west-1.s3" -> null
      - state                      = "available" -> null
      - subnet_ids                 = [] -> null
      - tags                       = {
          - "Name" = "hello-birthday-dev-s3-endpoint"
        } -> null
      - tags_all                   = {
          - "Name" = "hello-birthday-dev-s3-endpoint"
        } -> null
      - vpc_endpoint_type          = "Gateway" -> null
      - vpc_id                     = "vpc-029a6cd1da94ed29e" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 10 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "gunicorn_workers" but a
value was found in file "dev/dev.tfvars.json". If you meant to use this
value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

<!-- Sticky Pull Request Commentterraform-plan -->